Tekla Open API Reference for Tekla Structures 2025
LineSegment.Inequality Operator
 Checks the inequality of two line segments.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator !=(
	LineSegment Segment1,
	LineSegment Segment2
)
Public Shared Operator <> (
	Segment1 As LineSegment,
	Segment2 As LineSegment
) As Boolean
Parameters
Segment1
Type: Tekla.Structures.Geometry3d.LineSegment
The first line segment to be used.
Segment2
Type: Tekla.Structures.Geometry3d.LineSegment
The second line segment to be used.
Return Value
Type: Boolean
True if the two line segments are not equal. False otherwise.
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace